<template>
	<div class="yug-mod-dialog dialog-allow">
	  <div class="model-panel">
	    <div class="part-head"><h2>物流服务条款</h2></div>
	    <div class="part-body">
	      <p>
	        <strong>一、特别提示</strong>
	    	<span>
	    		<br>1、本服务协议中“物流服务”是五矿阿里钢铁平台（以下简称“平台”）推出的一种业务模式。在使用本平台提供的物流服务前，请务必仔细阅读并透彻理解本服务协议。用户可以主动取消或停止使用平台提供的物流产品或者相关物流服务，但如果用户使用本平台的物流产品或相关物流服务，则使用行为将被视为对本服务协议全部内容的认可。
	            <br>2、平台无法控制及保证物流过程中所涉及运输及与运输相关信息的真实性或准确性，以及有关各方履行其在运输及/或可能涉及的其他协议中各项义务的能力。除非平台另有明确规定，用户应自行谨慎判断确定相关服务或信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。若用户在使用承运方提供的物流服务中存在问题，可直接联系提供该服务的承运方或者也可联系平台协调解决。如用户选择交由平台进行沟通解决的，需要用户及时反馈在运输过程中遇到的问题并对侵权行为进行举报，平台并不当然的参与纠纷的处理及解决。
	            <br>3、为方便用户的使用，平台对承运人可信赖程度的评级、推荐或风险提示仅供用户参考，平台不担保该等评级、推荐或风险提示的准确性、完整性及有效性，对推荐之承运方提供的物流服务亦不承担任何法律责任。
	            <br>4、用户应及时保存或备份运单、订单等其他信息。用户完全理解并同意，由于平台储存设备（上述设备包括但不限于各种以有形或无形载体出现的软件、硬件及其他可能的设施等）有限、设备故障、设备更新或设备受到攻击等设备原因、人为原因或其他不可抗力，用户使用平台服务储存的信息或数据等可能发生全部或部分删除、毁损、灭失或无法恢复的风险。用户同意并确认上述风险均须由用户自行承担，平台不承担任何责任。
	            <br>5、平台如果制订、修改本协议或各类规则向用户提供基于互联网以及移动网的相关服务，应在本页面及其相应页面进行公布通知，用户应该定期登陆本页面及其他相关页面，了解平台物流服务最新的协议内容。变更后的协议和规则一经在本页面及相关页面公布后，立即自动生效。如用户不同意相关变更，应当立即停止使用平台的物流服务。若用户在平台物流服务协议和规则变更七日后继续使用平台物流服务的，即表示用户接受已经修订的协议和规则。
	        </span>
	      </p>

	      <p>
	        <strong>二、使用规则</strong>
			<span>
				<br>1、用户在申请使用平台物流服务时，必须向平台提供真实的个人资料，如个人资料有任何变动，必须及时更新。
	      <br>2、用户必须同意接受平台通过电子邮件或其他方式向用户发送的物流业务相关信息。
	      <br>3、用户在使用平台物流服务过程中，必须遵循以下原则：
	      <br>(a) 遵守中国有关的法律和法规；
	      <br>(b) 不得为任何非法目的而使用平台服务系统；
	      <br>(c) 遵守所有与平台服务有关的协议、规定和程序；
	      <br>(d) 不得利用平台物流服务系统进行任何可能对互联网的正常运转造成不利影响的行为；
	      <br>(e) 不得利用平台物流服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
	      <br>(f) 不得对平台物流服务上的任何数据作商业性利用，包括但不限于在未经平台事先书面同意的情况下，以复制、传播等任何方式使用平台上展示的物流信息资料；
	      <br>(g) 不得利用平台物流服务进行违反诚实信用原则的不正当竞争行为，严禁或恶意下订单或虚假运输等其他恶意扰乱平台物流运营秩序；
	      <br>(h) 如发现任何非法使用用户帐号或帐号管理出现安全漏洞的情况，应立即通告平台。
	      <br>4、对于用户违反本服务协议，平台有权视用户的行为性质，采取包括但不限于删除用户发布信息内容、暂停使用许可、终止服务、限制使用、追究法律责任等措施，因平台采取上述合理措施给用户造成的损失，平台不承担任何责任。
	      <br>5、用户须对自己在使用平台物流服务过程中的行为承担法律责任，包括但不限于：对受到侵害者进行赔偿，以及在平台先承担了因用户的行为导致的行政处罚或侵权损害赔偿责任后，用户应给予平台等额的赔偿。
	    </span>
	      </p>

	      <p>
	        <strong>三、知识产权和其它合法权益</strong>
			<span>
				<br>1、平台提供的物流服务内容可能包括：物流信息、物流新闻、行业资讯、物流黄页等。所有这些内容受版权、商标和其他知识产权性法律的保护。用户只有在获得平台的授权之后才能使用这些内容，而不能擅自复制、修改、使用这些内容、或利用上述内容创作相同或近似的衍生产品。
	      <br>2、平台对物流服务包含的产品拥有完整的知识产权。平台在此授予用户个人非独家、不可转让、可撤销的，并通过在一部拥有所有权或使用权的手机或计算机上使用本平台软件的权利，且该使用仅限于个人非商业性使用之合法目的。
	      <br>3、平台有权对自有物流软件进行时不时的修订、扩展、升级等更新措施，而无需提前通知用户。
	      <br>4、用户应当保证合法使用该等软件，任何用户不得对该等软件进行如下违法行为：
	      <br>(a) 开展反向工程、反向编译或反汇编，或以其他方式发现其原始编码，以及实施任何涉嫌侵害著作权等其他知识产权的行为；
	      <br>(b) 以出租、租赁、销售、转授权、分配或其他任何方式向第三方转让该等软件或利用该等软件为任何第三方提供相似服务；
	      <br>(c) 任何复制该等软件的行为；
	      <br>(d) 以移除、规避、破坏、损害或其他任何方式干扰该等软件的安全功能；
	      <br>(e) 以不正当手段取消该等软件上权利声明或权利通知的；
	      <br>(f) 其他违反法律规定的行为。
			</span>
	      </p>

	      <p>
	        <strong>四、隐私保护</strong>
			<span>
				<br>1、保护用户隐私是平台物流服务的一项基本政策，本平台保证不对外公开或向第三方提供用户注册资料及用户在使用网络服务时存储在平台的非公开内容，但下列情况除外：
	      <br>(a) 事先获得用户的明确授权；
	      <br>(b) 根据有关的法律法规要求；
	      <br>(c) 按照相关政府主管部门的要求；
	      <br>(d) 为维护社会公众的利益；
	      <br>(e) 为维护本平台的合法权益。
				<br>2、平台可能会与第三方合作向用户提供相关的物流服务，在此情况下，如该第三方同意承担与本平台同等的保护用户隐私的责任，则本平台可将用户的注册资料等提供给该第三方。
	      <br>3、在不透露单个用户隐私资料的前提下，本平台有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
	    </span>
	      </p>

	      <p>
	        <strong>五、免责声明</strong>
			<span>
				<br>1、用户明确同意其使用平台物流服务所存在的风险将完全由自己承担；因其使用平台物流服务而产生的一切后果也由自己承担，本平台对用户不承担任何责任。
	      <br>2、平台不担保物流服务一定能满足用户的要求，也不担保服务不会中断，对服务的及时性、安全性、准确性也均不作担保，但平台会从方便用户角度出发，尽最大所能满足用户需求。
			</span>
	      </p>

	      <p>
	        <strong>六、服务变更、中断或终止</strong>
			<span>
				<br>1、如因系统维护或升级的需要而需暂停网络服务，平台将尽可能事先进行通告。
				<br>2、如发生下列任何一种情形，平台有权随时中断或终止向用户提供本协议项下的网络服务而无需通知用户：
	      <br>(a) 用户提供的个人资料不真实；
	      <br>(b) 用户违反本协议中规定的使用规则。
			  <br>3、用户完全理解并同意本服务涉及到互联网及移动通讯等服务可能会受到各个环节不稳定因素的影响，因此任何因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机、GSM网络、互联网络、通信线路等其他平台无法预测或控制的原因造成的服务中断、取消或终止的风险须用户自行承担，本平台无需对用户或任何第三方承担任何责任。
	      <br>4、用户完全理解并同意，除本服务协议另有规定外，鉴于网络服务的特殊性，平台有权随时变更、中断或终止部分或全部的网络服务，且无需通知用户，也无需对用户或任何第三方承担任何责任。

			</span>
	      </p>

	      <p>
	        <strong>七、违约责任与纠纷处理</strong>
			<span>
				<br>1、用户在使用平台提供的物流服务过程中发生纠纷时，可自行协商解决，或由平台协助解决。协商或调解不成，可向有管辖权的法院起诉。
	      <br>2、用户违约的，平台有权根据其违约性质及程度作出降低会员等级、公布违约名单、暂停服务或移交司法机关追究刑事责任等处理。
			</span>
	      </p>

	      <p>
	        <strong>八、其它</strong>
			<span>
				<br>1、本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。
	      <br>2、如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向平台所在地的人民法院提起诉讼。
	      <br>3、平台未行使或执行本服务协议任何权利或规定，不构成对前述权利或权利之放弃。
	      <br>4、如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
			</span>
	      </p>
	    </div>
	    <div class="part-foot"><a target="_self" class="btn" datatype="confirm" v-touch:tap="agree">确定</a></div>
	  </div>
	</div>
</template>
<script>
	export default {
		methods:{
			agree(){
				this.$emit('agree');
			}
		}
	}
</script>
<style>
   .yug-mod-dialog{
   	z-index: 1;
   }
   .yug-mod-dialog .model-panel {
   	left:0;
   	top:0; 
   }
    .yug-mod-dialog .part-body {
    	position: fixed;
      padding-bottom: 150px;
      height: 100%;
    }

    .part-foot {
      position: fixed;
      bottom: 0;
      width: 100%;
      background: #fff;
    }

    .yug-mod-dialog .part-body p {
      padding: 0 5px;
    }

    .yug-mod-dialog .model-panel {
      width: 100%;
      margin: 0;
    }	
</style>